---
kind: type
id: T:Autodesk.Revit.DB.SymbolicCurve
source: html/c6c3bde4-4aa9-1b08-cd71-2fad0613d276.htm
---
# Autodesk.Revit.DB.SymbolicCurve

A curve that provides information but is not intended to represent actual geometry in an element.

## Syntax (C#)
```csharp
public class SymbolicCurve : CurveElement
```

## Remarks
For example, when creating a door family, you might sketch symbolic lines in an elevation view to represent a door swing.
Symbolic curves are visible parallel to the view in which you sketch them.